{"meta":{"title":"Fikrs.com","subtitle":"Zettelkasten for memories","description":"This is a personal blog for myself","author":"Jeong Lyel Hwang","url":"https://hjlgood.github.io","root":"/"},"pages":[{"title":"about","date":"2021-11-24T15:08:42.000Z","updated":"2021-11-24T15:09:04.249Z","comments":true,"path":"about/index.html","permalink":"https://hjlgood.github.io/about/index.html","excerpt":"","text":""},{"title":"categories","date":"2021-11-24T15:08:04.000Z","updated":"2021-11-24T15:08:19.140Z","comments":true,"path":"categories/index.html","permalink":"https://hjlgood.github.io/categories/index.html","excerpt":"","text":""},{"title":"tags","date":"2021-11-24T15:08:26.000Z","updated":"2021-11-24T15:08:34.330Z","comments":true,"path":"tags/index.html","permalink":"https://hjlgood.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Why I Chose Hexo","slug":"20211129-Why I Chose Hexo","date":"2021-11-27T15:00:00.000Z","updated":"2021-11-28T17:10:43.652Z","comments":true,"path":"2021/11/28/20211129-Why I Chose Hexo/","link":"","permalink":"https://hjlgood.github.io/2021/11/28/20211129-Why%20I%20Chose%20Hexo/","excerpt":"","text":"In this blogpost, I would like to share my experience of building a blog using Hexo. What is HexoHexo is a static-site blog framework based on Node.js. You can use MARKDOWN to write your blog posts and deploy it on Github-Pages or GitLab-Pages using Hexo. Why HexoThere are plenty of other blogging tools and websites, most notably Wordpress, but I chose Hexo to build my website. Here are a couple of reasons why I chose Hexo over other platforms. 1. You own your own contentA long time ago when I was in college, I made a blog using Blogger to save some of my work online. It included some texts and images of my assignments so I could download it in case I forgot to bring a USB stick. Few years later after graduation, I found out that Google removed all of my images from the blog due to ‘inactivation’. Not only was I disappointed, but also there was nothing I could do to retrieve those contents. This is because when you upload your content online, you’re relying on the service provider to keep you contents safe. If you use Hexo, you can keep all your source in your local machine where you can keep it safe. 2. GitHub provides free hostingHexo provides quite a few options when deploying your website. Perhaps the most common one is GitHub, but there are also other options such as Heroku, Netlify, Rsync, OpenShift, FTPSync, SFTP, Vercel, 21YunBox, Bip, or RSS3. If you have your own hosting server, you can copy your contents from the “public” folder and paste it in your server. Personally, I chose GitHub because GitHub is by far the most common website where poeple store their code. (It’s also free!)As logn as you pay for the domain name for your website, you’re good to go. 3. Markdown supportHexo supports Markdown file by default. you can use your favorite editor to write your blog posts and save it as .md file in your local machine. I personally use Visual Studio Code alongside with Foambubble to use this place as my personal Zettelkasten. 4. FoambubbleFoam is an extension to Visual Studio Code editor, arguably one the most famous text editors for programmers. It provides some interesting features like markdown template and wikilinks which helps you navigate through your files. Explaining what Foam is requires a whole separate post, but in essence, it’s a tool that generates relationships between your ideas. Here is an example of a well developed graph created using Foam. 5. Plethora of themesHexo supports plenty of themes and templates using .ejs or .swig. You might want to check out some free themes created by Hexo community at here. ConclusionThis was a short post to introduce to you some of the reasons why I decided to use Hexo as my blogging framework. In the following post, I’ll explain how to set up a blog using Hexo and point out some of the tricky parts that you may encounter. Hope you enjoy.","categories":[{"name":"blog","slug":"blog","permalink":"https://hjlgood.github.io/categories/blog/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"https://hjlgood.github.io/tags/Hexo/"},{"name":"web","slug":"web","permalink":"https://hjlgood.github.io/tags/web/"},{"name":"blog","slug":"blog","permalink":"https://hjlgood.github.io/tags/blog/"}]},{"title":"Hello World","slug":"hello-world","date":"2021-11-24T14:58:46.521Z","updated":"2021-11-24T15:14:42.679Z","comments":true,"path":"2021/11/24/hello-world/","link":"","permalink":"https://hjlgood.github.io/2021/11/24/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[{"name":"practice","slug":"practice","permalink":"https://hjlgood.github.io/categories/practice/"}],"tags":[{"name":"new","slug":"new","permalink":"https://hjlgood.github.io/tags/new/"}]}],"categories":[{"name":"blog","slug":"blog","permalink":"https://hjlgood.github.io/categories/blog/"},{"name":"practice","slug":"practice","permalink":"https://hjlgood.github.io/categories/practice/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"https://hjlgood.github.io/tags/Hexo/"},{"name":"web","slug":"web","permalink":"https://hjlgood.github.io/tags/web/"},{"name":"blog","slug":"blog","permalink":"https://hjlgood.github.io/tags/blog/"},{"name":"new","slug":"new","permalink":"https://hjlgood.github.io/tags/new/"}]}